Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

СтандартнаяОбработка = ложь;
Поля.Добавить("Наименование"); 
Поля.Добавить("ВидНоменклатуры");

КонецПроцедуры  

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

СтандартнаяОбработка = ложь;
Если ЗначениеЗаполнено(Данные.ВидНоменклатуры)  Тогда
	
    Представление = Данные.Наименование + " ("+ НРег(Строка(Данные.ВидНоменклатуры)) +")";
	
Иначе

	Представление = Данные.Наименование;

КонецЕсли;

КонецПроцедуры

